[
  {
    "id": 0,
    "name": "Build Your Own AngularJS",
    "rating": 5,
    "availability": 0,
    "review": "Build Your Own AngularJS helps you understand everything there is to understand about Angular. By creating your very own implementation of Angular piece by piece, you gain deep insight into what makes this framework tick. Say goodbye to fixing problems by trial and error and hello to reasoning your way through them. This book will teach you the inner workings of AngularJS by guiding you through implementing your own version of the framework from the ground up.Each feature is introduced by discussing what it's used for and why it's needed. The feature is then implemented step by step using test-driven development practices: By writing a failing test and then making it pass.",
    "thumb": "http://d.gr-assets.com/books/1391710005l/20743292.jpg",
    "author": "Tero Parviainen",
    "category": "AngularJS",
    "date_published": "2015",
    "pages": 1016
  },
  {
    "id": 1,
    "name": "Professional AngularJS",
    "rating": 5,
    "availability": 3,
    "review": "A comprehensive guide to AngularJS, Google's open-source client-side framework for app development. Most of the existing guides to AngularJS struggle to provide simple and understandable explanations for more advanced concepts. As a result, some developers who understand all the basic concepts of AngularJS struggle when it comes to building more complex real-world applications. Professional AngularJS provides a thorough understanding of AngularJS, covering everything from basic concepts, such as directives and data binding, to more advanced concepts like transclusion, build systems, and automated integration testing. In addition to explaining the features of AngularJS, this book distills real-world experience on how these features fit together to enable teams to work together more effectively in building extraordinary apps.",
    "thumb": "https://images-na.ssl-images-amazon.com/images/I/51Oi-g%2B3nnL._SX396_BO1,204,203,200_.jpg",
    "author": "Valeri Karpov, Diego Netto",
    "date_published": "2015",
    "pages": 254,
    "category": "AngularJS"
  },
  {
    "id": 2,
    "name": "Learning AngularJS",
    "rating": 3,
    "availability": 5,
    "review": "With AngularJS, you can quickly build client-side applications that run well on any desktop or mobile platform, using REST web services for backend processes. You may have heard that the learning curve for this JavaScript MVC framework is too steep, but that’s not the case. This practical guide provides a hands-on approach to learning AngularJS that will have you building high-quality applications and websites in no time. Along with a conceptual understanding of the framework, you’ll also gain direct experience with AngularJS by building a sample application throughout the book. If you’re familiar with JavaScript, web development, and software design concepts and patterns, this book is the perfect way to get started.",
    "thumb": "http://akamaicovers.oreilly.com/images/0636920035831/cat.gif",
    "author": "Ken Williamson",
    "pages":212,
    "category": "AngularJS",
    "date_published": "2015"
  },
  {
    "id": 3,
    "name": "ng-book",
    "rating": 4,
    "availability": 3,
    "review": "What if you could master the entire framework – with solid foundations – in less time without beating your head against a wall? Imagine how quickly you could work if you knew the best practices and the best tools?Stop wasting your time searching and have everything you need to be productive in one, well-organized place, with complete examples to get your project up without needing to resort to endless hours of research. You will learn what you need to know to work professionally with ng-book: The Complete Book on AngularJS or get your money back.",
    "thumb": "https://www.ng-book.com/images/flatbook-ngbook-small.png",
    "author": "Ari Lerner",
    "pages":624,
    "category": "AngularJS",
    "date_published": "2013"

  },
  {
    "id": 4,
    "name": "CSS: The Missing Manual",
    "rating": 5,
    "availability": 18,
    "review": "CSS lets you create professional websites, but learning its finer points can be tricky — even for seasoned web developers. This fully updated edition provides the most modern and effective tips, tricks, and tutorial-based instruction on CSS available today. Learn how to use new tools such as Flexbox and sass to build web pages that look great and run fast on any desktop or mobile device. Ideal for casual and experienced designers alike.",
    "thumb": "http://akamaicovers.oreilly.com/images/0636920036357/cat.gif",
    "author": "David Sawyer McFarland",
    "pages":718,
    "category": "CSS",
    "date_published": "2015"
  },
  {
    "id": 5,
    "name": "Head First HTML5 Programming",
    "rating": 4,
    "availability": 0,
    "review": "HTML has been on a wild ride. Sure, HTML started as a mere markup language, but more recently HTML’s put on some major muscle. Now we’ve got a language tuned for building web applications with Web storage, 2D drawing, offline support, sockets and threads, and more. And to speak this language you’ve got to go beyond HTML5 markup and into the world of the DOM, events, and JavaScript APIs. Head First HTML5 Programming is your ultimate tour guide to creating web applications with HTML5 and JavaScript, and we give you everything you need to know to build them, including: how to add interactivity to your pages, how to communicate with the world of Web services, and how to use the great new APIs being developed for HTML5.",
    "thumb": "http://akamaicovers.oreilly.com/images/0636920010906/cat.gif",
    "author": "Eric Freeman, Elisabeth Robson",
    "category": "HTML",
    "date_published": "2011",
    "pages": 610
  },
  {
    "id": 6,
    "name": "HTML and CSS: Design and Build Websites",
    "rating": 3,
    "availability": 6,
    "review": "Every day, more and more people want to learn some HTML and CSS. Joining the professional web designers and programmers are new audiences who need to know a little bit of code at work (update a content management system or e-commerce store) and those who want to make their personal blogs more attractive. Many books teaching HTML and CSS are dry and only written for those who want to become programmers, which is why this book takes an entirely new approach. This educational book is one that you will enjoy picking up, reading, then referring back to. It will make you wish other technical topics were presented in such a simple, attractive and engaging way!",
    "thumb": "https://images-na.ssl-images-amazon.com/images/I/41Z2swEmwaL._SX396_BO1,204,203,200_.jpg",
    "author": "Jon Duckett",
    "pages":490,
    "category": "HTML",
    "date_published": "2011"
  },


  {
    "id": 7,
    "name": "HTML5. Недостающее руководство",
    "rating": 3,
    "availability": 2,
    "review": "Доступно и в занимательной форме рассказано, как HTML превратился в HTML5. Рассмотрены семантические элементы и новые стандарты языка. Описано, как создавать современные веб-страницы, в том числе улучшенные веб-формы, поддерживать аудио и видео, рисовать на холсте, совершенствовать оформление веб-страниц с помощью CSS3. Даны практические рекомендации по созданию ин- теллектуальных веб-приложений, хранению данных, разработке автономных при- ложений. Показано, как реализовать взаимодействие с веб-сервером, геолокацию, фоновые вычисления, управление историей просмотров и браузерную совмести- мость с элементами HTML5.",
    "thumb": "http://static1.ozone.ru/multimedia/books_covers/1011675202.jpg",
    "author": "Мэтью Макдональд",
    "pages":480,
    "category": "HTML",
    "date_published": "2011"
  },
  {
    "id": 8,
    "name": "Learning JavaScript",
    "rating": 3,
    "availability": 6,
    "review": "This is an exciting time to learn JavaScript. Now that the latest JavaScript specification—ECMAScript 6.0 (ES6)—has been finalized, learning how to develop high-quality applications with this language is easier and more satisfying than ever. This practical book takes programmers (amateurs and pros alike) on a no-nonsense tour of ES6, along with some related tools and techniques. Author Ethan Brown (Web Development with Node and Express) not only guides you through simple and straightforward topics (variables, control flow, arrays), but also covers complex concepts such as functional and asynchronous programming. You’ll learn how to create powerful and responsive web applications on the client, or with Node.js on the server.",
    "thumb": "http://akamaicovers.oreilly.com/images/0636920035534/cat.gif",
    "author": "Ethan Brown",
    "pages":358,
    "category": "JavaScript",
    "date_published": "2016"
  },
  {
    "id": 9,
    "name": "Functional Programming in JavaScript",
    "rating": 3,
    "availability": 6,
    "review": "Functional Programming in JavaScript teaches you techniques to improve your web applications—their extensibility, modularity, reusability, and testability, as well as their performance. This easy-to-read book uses concrete examples and clear explanations to show you how to use functional programming in real life. If you’re new to functional programming, you’ll appreciate this guide’s many insightful comparisons to imperative or object-oriented programming that help you understand functional design. By the end, you’ll think about application design in a fresh new way, and you may even grow to appreciate monads!",
    "thumb": "https://images.manning.com/255/340/resize/book/5/c5bd123-f4fd-4a03-9069-9309c782ea7e/Atencio_hires_Fc.png",
    "author": "Luis Atencio",
    "pages":272,
    "category": "JavaScript",
    "date_published": "2016"
  },
  {
    "id": 10,
    "name": "Understanding ECMAScript 6",
    "rating": 3,
    "availability": 6,
    "review": "ECMAScript 6 represents the biggest update to the core of JavaScript in the history of the language. In Understanding ECMAScript 6, expert developer Nicholas C. Zakas provides a complete guide to the object types, syntax, and other exciting changes that ECMAScript 6 brings to JavaScript. Every chapter is packed with example code that works in any JavaScript environment so you'll be able to see new features in action. Whether you're a web developer or a Node.js developer, you'll find Understanding ECMAScript 6 indispensable on your journey from ECMAScript 5 to ECMAScript 6.",
    "thumb": "https://www.nostarch.com/sites/default/files/imagecache/product_full/understandingECMAscript6_cover.png",
    "author": "Nicholas C. Zakas",
    "pages":352,
    "category": "JavaScript",
    "date_published": "2016"
  },
  {
    "id": 11,
    "name": "JS: ES6 & Beyond",
    "rating": 4,
    "availability": 2,
    "review": "No matter how much experience you have with JavaScript, odds are you don’t fully understand the language. As part of the \"You Don’t Know JS\" series, this compact guide focuses on new features available in ECMAScript 6 (ES6), the latest version of the standard upon which JavaScript is built. Like other books in this series, You Don’t Know JS: ES6 & Beyond dives into trickier parts of the language that many JavaScript programmers either avoid or know nothing about. Armed with this knowledge, you can achieve true JavaScript mastery.",
    "thumb": "http://akamaicovers.oreilly.com/images/0636920033769/cat.gif",
    "author": "Kyle Simpson",
    "pages":278,
    "category": "JavaScript",
    "date_published": "2015"
  },
  {
    "id": 26,
    "name": "Sass for Web Designers",
    "rating": 5,
    "availability": 3,
    "review": "Let’s face it: CSS is hard. Our stylesheets are more complex than they used to be, and we’re bending the spec to do as much as it can. Can Sass help? A reluctant convert to Sass, Dan Cederholm shares how he came around to the popular CSS pre-processor, and provides a clear-cut path to taking better control of your code (all the while working the way you always have). From getting started to advanced techniques, Dan will help you level up your stylesheets and instantly start taking advantage of the power of Sass.",
    "thumb": "https://images-na.ssl-images-amazon.com/images/I/31Tckp8k2pL._SX247_BO1,204,203,200_.jpg",
    "author": "Dan Coderholm",
    "pages":97,
    "category": "Sass",
    "date_published": "2013"
  },
  {
    "id": 12,
    "name": "JS: Async & Performance",
    "rating": 4,
    "availability":4,
    "review": "No matter how much experience you have with JavaScript, odds are you don’t fully understand the language. As part of the \"You Don’t Know JS\" series, this compact guide focuses on new features available in ECMAScript 6 (ES6), the latest version of the standard upon which JavaScript is built. Like other books in this series, You Don’t Know JS: ES6 & Beyond dives into trickier parts of the language that many JavaScript programmers either avoid or know nothing about. Armed with this knowledge, you can achieve true JavaScript mastery.",
    "thumb": "http://akamaicovers.oreilly.com/images/0636920033752/cat.gif",
    "author": "Kyle Simpson",
    "pages":298,
    "category": "JavaScript",
    "date_published": "2015"
  },
  {
    "id": 13,
    "name": "JavaScript для профессионалов",
    "rating": 4,
    "availability": 5,
    "review": "Эта книга является незаменимым пособием для профессиональных разработчиков современных веб-приложений на JavaScript. Читатель найдет в ней все, что требуется знать о современном состоянии языка JavaScript, его достоинствах и недостатках, новых языковых средствах, внедренных в последних версиях стандарта ECMAScript, передовых приемах отладки и тестирования кода, а также инструментальных средствах разработки. Книга изобилует многочисленными практическими и подробно разбираемыми примерами кода, повторно используемых функций и классов, экономящих время разработчиков. Она помогает им овладеть практическими навыками написания динамических веб-приложений на высоком профессиональном уровне, а также повысить свою квалификацию.",
    "thumb": "http://static2.ozone.ru/multimedia/books_covers/1013838149.jpg",
    "author": "Джон Резиг, Расс Фергюсон, Джон Пакстон",
    "pages":240,
    "category": "JavaScript",
    "date_published": "2015"
  },
  {
    "id": 14,
    "name": "JS: Types & Grammar",
    "rating": 4,
    "availability": 5,
    "review": "No matter how much experience you have with JavaScript, odds are you don’t fully understand the language. As part of the \"You Don’t Know JS\" series, this compact guide explores JavaScript types in greater depth than previous treatments by looking at type coercion problems, demonstrating why types work, and showing you how to take advantage of these features. Like other books in this series, You Don’t Know JS: Types & Grammar dives into trickier parts of the language that many JavaScript programmers simply avoid or assume don’t exist (like types). Armed with this knowledge, you can achieve true JavaScript mastery.",
    "thumb": "http://akamaicovers.oreilly.com/images/0636920033745/cat.gif",
    "author": "Kyle Simpson",
    "pages":198,
    "category": "JavaScript",
    "date_published": "2015"
  },
  {
    "id": 15,
    "name": "Eloquent JavaScript",
    "rating": 5,
    "availability": 1,
    "review": "Eloquent JavaScript, 2nd Edition dives deep into the JavaScript language to show you how to write beautiful, effective code. Author Marijn Haverbeke immerses you in example code from the start, while exercises and full-chapter projects give you hands-on experience with writing your own programs. This edition is thoroughly revised and modernized to reflect the current state of JavaScript and web browsers, with brand-new material, such as a chapter on code performance in JavaÂ­Script, and expanded coverage of recursion and closures. All source code is available online in an interactive sandbox, where you can edit the code, run it, and see its output instantly.",
    "thumb": "https://www.nostarch.com/sites/default/files/imagecache/product_main_page/EJS2_cover-front.png",
    "author": "Marijn Haverbeke",
    "pages":472,
    "category": "JavaScript",
    "date_published": "2014"
  },
  {
    "id": 16,
    "name": "JavaScript Data Structures and Algorithms",
    "rating": 5,
    "availability": 1,
    "review": "A data structure is a particular way of organizing data in a computer to utilize resources efficiently. Data structures and algorithms are the base of every solution to any programming problem.This book begins by covering the basics of the JavaScript language and then moves on to discuss the most important data structures such as array, queue, stack, and linked list. You will also gain an in-depth knowledge of how hash tables and set data structure function. After this, you will be taught what trees are, and how to use the binary tree and the binary search tree. In subsequent chapters, you will learn about graphs, DFS, and BFS. Finally, we will round off by learning how to differentiate between various searching and sorting algorithms such as sequential search, binary search, quick sort, bubble sort, and so on, and how to implement them. Towards the end of the book, you will also be introduced to dynamic programming.",
    "thumb": "https://d1ldz4te4covpm.cloudfront.net/sites/default/files/imagecache/ppv4_main_book_cover/4874OS_Learning%20JavaScript%20Data%20Structures%20and%20Algorithms.jpg",
    "author": "Loiane Groner",
    "pages":218,
    "category": "JavaScript",
    "date_published": "2014"
  },
  {
    "id": 17,
    "name": "JS: this & Object Prototypes",
    "rating": 3,
    "availability": 4,
    "review": "No matter how much experience you have with JavaScript, odds are you don’t fully understand the language. This concise, in-depth guide takes you inside JavaScript’s this structure and object prototypes. You’ll learn how they work and why they’re integral to behavior delegation—a design pattern in which objects are linked, rather than cloned. Like other books in the \"You Don’t Know JS\" series, this and Object Prototypes dives into trickier parts of the language that many JavaScript programmers simply avoid. Armed with this knowledge, you can become a true JavaScript master.",
    "thumb": "http://akamaicovers.oreilly.com/images/0636920033738/cat.gif",
    "author": "Kyle Simpson",
    "pages":174,
    "category": "JavaScript",
    "date_published": "2014"
  },
  {
    "id": 18,
    "name": "JS: Scope & Closures",
    "rating": 3,
    "availability": 4,
    "review": "No matter how much experience you have with JavaScript, odds are you don’t fully understand the language. This concise yet in-depth guide takes you inside scope and closures, two core concepts you need to know to become a more efficient and effective JavaScript programmer. You’ll learn how and why they work, and how an understanding of closures can be a powerful part of your development skillset. Like other books in the \"You Don’t Know JS\" series, Scope and Closures dives into trickier parts of the language that many JavaScript programmers simply avoid. Armed with this knowledge, you can achieve true JavaScript mastery.",
    "thumb": "http://akamaicovers.oreilly.com/images/0636920026327/cat.gif",
    "author": "Kyle Simpson",
    "pages":98,
    "category": "JavaScript",
    "date_published": "2014"
  },
  {
    "id": 19,
    "name": "Functional Programming in JavaScript",
    "rating": 5,
    "availability": 4,
    "review": "This is a fast-paced guide that will help you to write real-world applications by utilizing a wide range of functional techniques and styles.The book first explores the core concepts of functional programming common to all functional languages, with examples of their use in JavaScript. It's followed by a comprehensive roundup of functional programming libraries for JavaScript that minimizes the burden of digging deep into JavaScript to expose a set of tools that makes functional programming not just possible but highly convenient. The book then rounds off with an overview of methods to effectively use and mix functional programming with object-oriented programming.",
    "thumb": "https://d1ldz4te4covpm.cloudfront.net/sites/default/files/imagecache/ppv4_main_book_cover/9781784398224.png",
    "author": "Dan Mantyla",
    "pages":172,
    "category": "JavaScript",
    "date_published": "2013"
  },
  {
    "id": 20,
    "name": "Effective JavaScript",
    "rating": 3,
    "availability": 2,
    "review": "Effective JavaScript is an in-depth look at the JavaScript programming language and how to use it effectively to write more portable, robust, and maintainable applications and libraries. Using the concise, scenario-driven style of the Effective Software Development Series, this book brings together tips, techniques, and realistic code examples to explain the important concepts in JavaScript. This book is for anyone looking for a thorough understanding of JavaScript. It is especially aimed at programmers who are just learning JavaScript or existing JavaScript programmers interested in deepening their knowledge of the language and its most important idioms.",
    "thumb": "http://effectivejs.com/img/book-thumbnail.jpg",
    "author": "David Herman",
    "pages":240,
    "category": "JavaScript",
    "date_published": "2012"
  },
  {
    "id": 21,
    "name": "Сила JavaScript",
    "rating": 3,
    "availability": 2,
    "review": "Effective JavaScript is an in-depth look at the JavaScript programming language and how to use it effectively to write more portable, robust, and maintainable applications and libraries. Using the concise, scenario-driven style of the Effective Software Development Series, this book brings together tips, techniques, and realistic code examples to explain the important concepts in JavaScript. This book is for anyone looking for a thorough understanding of JavaScript. It is especially aimed at programmers who are just learning JavaScript or existing JavaScript programmers interested in deepening their knowledge of the language and its most important idioms.",
    "thumb": "http://static1.ozone.ru/multimedia/books_covers/1010560554.jpg",
    "author": "Дэвид Херман",
    "pages":288,
    "category": "JavaScript",
    "date_published": "2012"
  },
  {
    "id": 22,
    "name": "Learning React (Early Release)",
    "rating": 2,
    "availability": 3,
    "review": "Interested in React but find yourself confused about how to use it with the Flux architecture? This is your book. Authors Alex Banks and Eve Porcello show you how to build React applications with the entire React ecosystem—including Flux. You’ll learn about the methodologies behind the creation of the library and its related tools through short interviews with key players in the React community. Learning React is ideal for web developers and software engineers who understand how JavaScript, CSS, and HTML work in the browser, but have no prior understanding of React, functional JavaScript, Flux, or even advanced JavaScript. This book covers both ES5 or ES6 syntax commonly used with React.",
    "thumb": "http://akamaicovers.oreilly.com/images/0636920049579/rc_cat.gif",
    "author": "Alex Banks, Eve Porcello",
    "pages":146,
    "category": "React",
    "date_published": "2016"
  },
  {
    "id": 23,
    "name": "ReactJS by Example",
    "rating": 4,
    "availability": 3,
    "review": "ReactJS is an open-source JavaScript library that brings the power of reactive programming to web applications and sites. It aims to address the challenges encountered in developing single-page applications, and is intended to help developers build large, easily scalable and changing web apps. Starting with a project on Open Library API, you will be introduced to React and JSX before moving on to learning about the life cycle of a React component. In the second project, building a multi-step wizard form, you will learn about composite dynamic components and perform DOM actions. You will also learn about building a fast search engine by exploring server-side rendering in the third project on a search engine application. Next, you will build a simple frontpage for an e-commerce app in the fourth project by using data models and React add-ons. In the final project you will develop a complete social media tracker by using the flux way of defining React apps and know about the best practices and use cases with the help of ES6 and redux.",
    "thumb": "https://dz13w8afd47il.cloudfront.net/sites/default/files/imagecache/ppv4_main_book_cover/4730_9644OS_ReactJS%20by%20Example-%20Building%20Modern%20Web%20Applications%20with%20React.jpg",
    "author": "Vipul A M, Prathamesh Sonpatki",
    "pages":280,
    "category": "React",
    "date_published": "2016"
  },
  {
    "id": 24,
    "name": "Pro React",
    "rating": 3,
    "availability": 3,
    "review": "This book teaches you how to successfully structure increasingly complex front-end applications and interfaces. You'll explore the React library in depth, as well as detailing additional tools and libraries in the React ecosystem, enabling you to create complete, complex applications.",
    "thumb": "https://images-na.ssl-images-amazon.com/images/I/415K9iTHvmL._SX348_BO1,204,203,200_.jpg",
    "author": "Cassio de Sousa Antonio",
    "pages":320,
    "category": "React",
    "date_published": "2015"
  },
  {
    "id": 25,
    "name": "React.js Essentials",
    "rating": 5,
    "availability": 3,
    "review": "Building web applications with maintainable and performant user interfaces is a challenge that many have faced for more than a decade, but no one has risen to this challenge quite like React.js. Today React.js is used by Facebook, Instagram, Khan Academy, and Imperial College London, to name a few. Many new users recognize the benefits of React.js and adopt it in their own projects, forming a fast-growing community. The speed at which React.js has evolved promises a bright future for those who invest in learning it today.",
    "thumb": "https://www.packtpub.com/sites/default/files/ReactJSEssentials.png",
    "author": "Artemij Fedosejev",
    "pages":208,
    "category": "React",
    "date_published": "2015"
  },
  {
    "id": 27,
    "name": "Express in Action",
    "rating": 5,
    "availability": 3,
    "review": "Express in Action teaches you how to build web applications using Node and Express. It starts by introducing Node’s powerful traits and shows you how they map to the features of Express. You'll explore key development techniques, meet the rich ecosystem of companion tools and libraries, and get a glimpse into its inner workings. By the end of the book, you'll be able to use Express to build a Node app and know how to test it, hook it up to a database, and automate the dev process.",
    "thumb": "https://images.manning.com/255/340/resize/book/3/01d3d4e-8cdb-49e9-a163-4ef3a6a241c0/Hahn-Express-HI.png",
    "author": "Evan M. Hahn",
    "pages":256,
    "category": "Express",
    "date_published": "2016"
  },
  {
    "id": 28,
    "name": "Mastering Web Application Development with Express",
    "rating": 3,
    "availability": 3,
    "review": "Prototyping an application is one thing, but making sure it's ready to launch is a whole different story. This book will enable you to create maintainable, high performance, and scalable web applications that will meet your production needs. From getting started to how to develop, hone, and protect your application with Express, this book gives you all the practical information you need to feel truly confident with the advanced features of Express. The essential bits and pieces of the framework are explained at the beginning, for a better understanding of the strong points of the framework. From there, we'll take you through the development of an application, from using middleware and template engines to RESTful APIs. By the end, you will have mastered the patterns of reusable code and error handling, and will have learned about other important aspects such as debugging, monitoring, and security.",
    "thumb": "https://d255esdrn735hr.cloudfront.net/sites/default/files/imagecache/ppv4_main_book_cover/1083OS_Mastering%20Web%20Application%20Development%20with%20Express_0.jpg",
    "author": "Alexandru Vlăduțu",
    "pages":358,
    "category": "Express",
    "date_published": "2014"
  },
  {
    "id": 29,
    "name": "Web Development with Node & Express",
    "rating": 4,
    "availability": 1,
    "review": "Learn how to build dynamic web applications with Express, a key component of the Node/JavaScript development stack. In this hands-on guide, author Ethan Brown teaches you the fundamentals through the development of a fictional application that exposes a public website and a RESTful API. You’ll also learn web architecture best practices to help you build single-page, multi-page, and hybrid web apps with Express. Express strikes a balance between a robust framework and no framework at all, allowing you a free hand in your architecture choices. With this book, frontend and backend engineers familiar with JavaScript will discover new ways of looking at web development.",
    "thumb": "http://akamaicovers.oreilly.com/images/0636920032977/cat.gif",
    "author": "Ethan Brown",
    "pages":332,
    "category": "Express",
    "date_published": "2014"
  },
  {
    "id": 30,
    "name": "Advanced Express Web Application Development",
    "rating": 5,
    "availability": 1,
    "review": "Building an Express application that is reliable, robust, maintainable, testable, and can scale beyond a single server requires a bit of extra thought and effort. Express applications that need to survive in a production environment will need to reach out to the Node ecosystem and beyond, for support. You will start by laying the foundations of your software development journey, as you drive-out features under test. You will move on quickly to expand on your existing knowledge, learning how to create a web API and a consuming client. You will then introduce a real-time element in your application. Following on from this, you will begin a process of incrementally improving your application as you tackle security, introduce SSL support, and how to handle security vulnerabilities. Next, the book will take you through the process of scaling and then decoupling your application. Finally, you will take a look at various ways you can improve your application's performance and reliability.",
    "thumb": "https://d1ldz4te4covpm.cloudfront.net/sites/default/files/imagecache/ppv4_main_book_cover/2494OS_Frontcover.jpg",
    "author": "Andrew Keig",
    "pages":332,
    "category": "Express",
    "date_published": "2013"
  },
  {
    "id": 31,
    "name": "MEAN Web Development",
    "rating": 4,
    "availability": 4,
    "review": "Starting with MEAN core frameworks, this project-based guide will explain the key concepts of each framework, how to set them up properly, and how to use popular modules to connect it all together. By following the real-world examples shown in this tutorial, you will scaffold your MEAN application architecture, add an authentication layer, and develop an MVC structure to support your project development. Finally, you will walk through the different tools and frameworks that will help expedite your daily development cycles.",
    "thumb": "https://images-na.ssl-images-amazon.com/images/I/5173wa99reL._SX403_BO1,204,203,200_.jpg",
    "author": "Amos Q. Haviv",
    "pages":354,
    "category": "MEAN Stack",
    "date_published": "2014"
  }


]